In [3]:
import pandas as pd
import numpy as np

### 1. Define the Pandas/Python pandas?

Pandas is an open source Python package that is most widely used for data science/data analysis and machine learning tasks.  
1. Pandas is open source library ehich basically designed to work with relational or lebeled data  
2. it provides various data structure and operation for numerical data and time serious  
3. pandas can store heterogeneous data  
4. it support series and data frame structure  
5. it analysed the data

#### 2. What are the different types of Data Structures in Pandas?

1. Series - 1D
2. Dataframe - 2D

3. Explain Series and DataFrame In Pandas

DataFrame => It is 2-D dimension data structure
tables with rows and column
series Data structure => It is one dimension data

#### 4. How Can You Create An Empty DataFrame and series in Pandas?

In [4]:
df=pd.DataFrame()
print(df)
s=pd.Series()
print(s)

Empty DataFrame
Columns: []
Index: []
Series([], dtype: float64)

C:\Users\manoj\AppData\Local\Temp/ipykernel_6348/1741164444.py:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s=pd.Series()

#### 5. How to check empty DataFrame?

In [6]:
df=pd.DataFrame()
if df.empty:
    print('yes, DF is empty')
else:
    print('DF is not empty')

yes, DF is empty

#### 6. How to check empty DataFrame?6. What Are The Most Important Features Of The Pandas Library?

1. Handling of data
2. Handling missing data
3. cleaning up data
4. alignment and indexing
5. input and output tools
6. support time series
7. python support
8. grouping
9. perform mathematical operation on data
10. Label-based slicing, indexing and subsetting of large data sets.
11. Columns from a data structure can be deleted or inserted.
12. Group by data for aggregation and transformations.
13. High performance merging and joining of data.

#### 7. How to check empty DataFrame?7. How Will You Explain Reindexing In Pandas?

1. Reindexing changes the row lables and columns lables of a DataFrame.
2. To reindex means to confirm the data to match an given set of lables along a perticular axis.
3. we can reorder the existing data to match a new set of lables.

#### 8. What are the different ways of creating DataFrame in pandas? Explain with examples.

In [5]:
# by passing list
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([5,6,7,8,9])
df = pd.DataFrame([s1,s2])
df

   0  1  2  3  4
0  1  2  3  4  5
1  5  6  7  8  9

In [7]:
# By passing dictionary
s1 = ({"Numbers":[i for i in range (1,6)],
"Squares":[i**2 for i in range (1,6)],
"cube": [i**3 for i in range (1,6)]})
df1 = pd.DataFrame(s1)
df1

   Numbers  Squares  cube
0        1        1     1
1        2        4     8
2        3        9    27
3        4       16    64
4        5       25   125

In [8]:
#By pasing array:
l1 = np.array([1,2,3,4,5])
l2 = np.array([10,20,30,40,50])
df1 = pd.DataFrame([l1,l2])
df1

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50

#### 9. Create a DataFrame using List.

In [13]:
l1 = [1,2,3,4,5,6]
l2 = [9,8,7,6,5,8]
df = pd.DataFrame(l1,l2)
df

   0
9  1
8  2
7  3
6  4
5  5
8  6

In [12]:
l1 = [1,2,3,4,5,6]
l2 = [9,8,7,6,5,8]
df = pd.DataFrame([l1,l2])
df

   0  1  2  3  4  5
0  1  2  3  4  5  6
1  9  8  7  6  5  8

#### 10. Create a DataFrame using Numpy Functions.

In [14]:
array1 = np.array([[1,2,3,4,5],[6,7,8,9,5]])
array1
df = pd.DataFrame(array1)
df

   0  1  2  3  4
0  1  2  3  4  5
1  6  7  8  9  5

#### 11. How to convert a NumPy array to a DataFrame of a given shape?

In [15]:
array1 = np.array([[1,2,3,4,5],[6,7,8,9,5]])
array1
df = pd.DataFrame(array1)
df

   0  1  2  3  4
0  1  2  3  4  5
1  6  7  8  9  5

#### 12. Create a DataFrame using Dictionary with a list and arrays.

In [16]:
dict1 = {'List':[1,2,3,4,5],
'array':np.array([1,2,3,4,5])}
df = pd.DataFrame(dict1)
df

   List  array
0     1      1
1     2      2
2     3      3
3     4      4
4     5      5

#### 13. How To Create A Copy Of The Series and DataFrame in Pandas?

In [19]:
series = pd.DataFrame([1,2,3,4,5])
series
shallow_copy = series.copy(deep=False)
shallow_copy

   0
0  1
1  2
2  3
3  4
4  5

In [21]:
deep_copy = series.copy(deep=True)
deep_copy

   0
0  1
1  2
2  3
3  4
4  5

#### 14. How Will You Add An Index, Row, Or Column To A DataFrame In Pandas?

##### Adding Column to DataFrame

In [3]:
# import numpy as np
# import pandas as pd
# ar1 = np.random.randint(10,100,size = [4,3])
# df = pd.DataFrame(ar1, columns = ['Column_1', 'Column_2', 'Column_3'], index = list('ABCD'))
# new = {'Column_1': 100, 'Column_2': 200, 'Column_3':300}
# df = df.append(new, ignore_index = True)
# df
import numpy as np
import pandas as pd
ar1 = np.random.randint(10,100,size = [4,3])
df = pd.DataFrame(ar1, columns = ['Column_1', 'Column_2', 'Column_3'])
df['New_col'] = [10,20,30,40]
df

   Column_1  Column_2  Column_3  New_col
0        93        10        99       10
1        63        26        39       20
2        72        80        17       30
3        23        83        76       40

##### Adding index to DataFrame

In [5]:
import numpy as np
import pandas as pd
ar1 = np.random.randint(10,100,size = [4,3])
df = pd.DataFrame(ar1, columns = ['Column_1', 'Column_2', 'Column_3'], index = list('ABCD'))
df

   Column_1  Column_2  Column_3
A        90        46        97
B        80        69        85
C        47        67        73
D        88        54        90

#### Q15. What Method Will You Use To Rename The Index Or Columns Of Pandas DataFrame?

In [5]:
import numpy as np
import pandas as pd
arr1 = np.array([[1,1,1],[2,4,8],[3,9,27],[4,16,64],[5,25,125]])
df = pd.DataFrame(arr1, columns=['Number','Square','Cube'], index=['row1','row2','row3','row4','row5'])
df

      Number  Square  Cube
row1       1       1     1
row2       2       4     8
row3       3       9    27
row4       4      16    64
row5       5      25   125

In [12]:
df = df.rename({'Number':'NUMBER','Square':'SQUARE','Cube':'CUBE'},axis=1)
df

      NUMBER  SQUARE  CUBE
row1       1       1     1
row2       2       4     8
row3       3       9    27
row4       4      16    64
row5       5      25   125

In [13]:
df = df.rename({'row3':'AAA','row5':'BBB'})
df

      NUMBER  SQUARE  CUBE
row1       1       1     1
row2       2       4     8
AAA        3       9    27
row4       4      16    64
BBB        5      25   125

#### 16. How Can You Iterate Over DataFrame In Pandas?

In [5]:
import numpy as np
import pandas as pd
data = {'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka'],
    'Age': [21, 19, 20, 18],
    'Stream': ['Math', 'Commerce', 'Arts', 'Biology'],
    'Percentage': [88, 92, 95, 70]}
# Convert the dictionary into DataFrame
df = pd.DataFrame(data, columns = ['Name', 'Age', 'Stream', 'Percentage'])
print("Given Dataframe :\n", df)
print("\nIterating over rows using index attribute :\n")
# iterate through each row and select
# 'Name' and 'Stream' column respectively.
for ind in df.index:
    print(df['Name'][ind], df['Stream'][ind])
for ind in df.index:
    print(ind)

Given Dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95
3   Priyanka   18   Biology          70

Iterating over rows using index attribute :

Ankit Math
Amit Commerce
Aishwarya Arts
Priyanka Biology
0
1
2
3

#### 16. How Can You Iterate Over DataFrame In Pandas?

In [6]:
a1 = [['Sneha',27],['Ashwini',25],['naved',24]]

df = pd.DataFrame(a1,index=list('ABC'),columns =['Name','Age'])
df

      Name  Age
A    Sneha   27
B  Ashwini   25
C    naved   24

In [8]:
for i,item in df.iteritems():
    print(i)
    print(item)
    print('*******')

Name
A      Sneha
B    Ashwini
C      naved
Name: Name, dtype: object
*******
Age
A    27
B    25
C    24
Name: Age, dtype: int64
*******

#### 17. How to create an array from DataFrame

In [1]:
import numpy as np
import pandas as pd
arr1 = np.array([[1,1,1],[2,4,8],[3,9,27],[4,16,64],[5,25,125]])
df = pd.DataFrame(arr1, columns=['Number','Square','Cube'], index=['row1','row2','row3','row4','row5'])
df

      Number  Square  Cube
row1       1       1     1
row2       2       4     8
row3       3       9    27
row4       4      16    64
row5       5      25   125

In [2]:
df.to_numpy()

array([[  1,   1,   1],
       [  2,   4,   8],
       [  3,   9,  27],
       [  4,  16,  64],
       [  5,  25, 125]])

#### 18. How to create a list from DataFrame

In [3]:
df.to_numpy().tolist()

[[1, 1, 1], [2, 4, 8], [3, 9, 27], [4, 16, 64], [5, 25, 125]]

#### 19. How to Reset the dataframes index?

In [6]:
df=pd.DataFrame({'A':[1,2,3,4,5],'B':[10,20,30,40,50],'C':['a','b','c','d','e']})
df

   A   B  C
0  1  10  a
1  2  20  b
2  3  30  c
3  4  40  d
4  5  50  e

In [ ]:

#### 20. Write a Pandas program to count the number of rows and columns of a DataFrame
#### 21. Write a Pandas program to add, subtract, multiple, and divide two Pandas Series
#### 22. Write a Pandas program to import excel data into a Pandas dataframe
#### 23. Write a Pandas program to read specific columns from a given excel file
#### 24. Write a Pandas program to find the sum, mean, max, min value of
#### 25. How Can A DataFrame Be Converted To An Excel File and CSV file?
#### 26. What is Groupby Function In Pandas? Explain with example
#### 27. What is the use of apply function in pandas?
#### 28. How to use apply() with lambda function?
#### 29. Explain is the use of info, describe, head, head, and tail functions
#### 30. Write a Pandas program to check whether only a title case is present in a given column of a DataFrame.
#### 31. What is the map Function In Pandas?
#### 32. How will you add a column to a pandas DataFrame?
#### 33. How will you add a column at a specific index to a pandas DataFrame?
#### 34. How to Delete Indices, Rows, or Columns From a Pandas DataFrame?
#### 35. How to get the items not common to both series A and series B?
#### 36. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?
#### 37. How can we sort the DataFrame?
#### 38. How to drop duplicate rows from DataFrame?
#### 39. How to drop duplicate columns from DataFrame?
#### 40. Write a Pandas program to split a string of a column of a given DataFrame into multiple columns(Split Name and Surname)